Revit 2024 API
VerticalTextAlignment Enumeration
 Supported types of vertical alignment of a text element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum VerticalTextAlignment
Visual Basic
Public Enumeration VerticalTextAlignment
Visual C++
public enum class VerticalTextAlignment
Members
Member name | Description
Top |  Top of the text box remains in place as the height of the text changes.
Bottom |  Bottom of the text box remains in place as the height of the text changes.
Middle |  The horizontal center line of the text box remains in place as the height of the text changes.
See Also
Autodesk.Revit.DB Namespace